const question = [
  {
    question: 'การแข่งขันนี้เป็นการแข่งขันเกี่ยวกับอะไร',
    answer: (
      <>
        การแข่งขันนี้เป็นการแข่งขันเขียนโปรแกรมแนว Competitive Programming
        โดยมีต้นแบบมาจากการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติและการแข่งขันคอมพิวเตอร์โอลิมปิกระหว่างประเทศ
      </>
    ),
  },
  {
    question: 'เขียนโปรแกรมไม่เก่งหรือไม่เป็น เข้าร่วมได้หรือไม่',
    answer: (
      <>
        พวกเรายินดีให้ท่านเข้าร่วมได้
        โดยทางเราขอแนะนำใหผู้ที่เขียนโปรแกรมไม่เป็นลองฝึกฝนกับเว็บไซต์พันธมิตร{' '}
        <a
          className="underline hover:text-gray-200"
          href="https://beta.programming.in.th"
          rel="noreferrer"
          target="_blank"
        >
          https://beta.programming.in.th
        </a>{' '}
        ให้ได้ตั้งแต่ข้อ 0000 ถึงข้อ 0020 ก่อน
        เราเชื่อว่าหากทำได้ในขั้นนั้นแล้วจะมีความรู้พื้นฐานเพียงพอให้ร่วมคิดร่วมเขียนในบางข้อได้
        แต่ว่าหากยังไม่มั่นใจหรืออยากฝึกฝนเพิ่มเติม
        ทางเราขอแนะนำให้ฝึกฝนต่อไปในโจทย์ระดับที่ยากขึ้น
        (เช่นโจทย์ที่ขึ้นต้นด้วยระดับ 10, 11 หรือ 20 เป็นต้น)
        นอกจากนี้เรายังมีโจทย์จากค่าย สสวท. คอมพิวเตอร์ ที่{' '}
        <a
          className="underline hover:text-gray-200"
          href="https://grader.thailandoi.org"
          rel="noreferrer"
          target="_blank"
        >
          https://grader.thailandoi.org
        </a>{' '}
        ซึ่งจะเป็นโจทย์ที่ยากและซับซ้อนมากยิ่งขึ้น
        เราเชื่อว่าการแข่งขันครั้งนี้จะช่วยพัฒนาศักยภาพของผู้เข้าแข่งขันไปในตัวด้วยเช่นกัน
      </>
    ),
  },
  {
    question: 'โจทย์ที่ใช้ในการแข่งขัน เป็นโจทย์แบบใด ความยากระดับไหน',
    answer: (
      <>
        ขณะนี้เรามีโจทย์ทดสอบระบบ 2 ข้อ
        ความยากของโจทย์ที่ใช้ในการแข่งขันจะยากประมาณโจทย์ทดสอบระบบ
        แต่ไม่ต้องกังวล
        โจทย์ทุกข้อจะมีปัญหาย่อยเพื่อให้ผู้เข้าแข่งขันได้คะแนนบางส่วน
        หากยังไม่สามารถทำวิธีที่ดีที่สุดได้
        หากเทียบกับในวงการคอมพิวเตอร์โอลิมปิกอาจกล่าวได้ว่าความยากอยู่ระหว่างการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติ
        และโจทย์คัดเลือกผู้แทนประเทศไทยไปแข่งคอมพิวเตอร์โอลิมปิกระหว่างประเทศอย่างไรก็ตาม
        เรารับประกันว่าจะใช้เนื้อหาไม่เกินการแข่งขันคอมพิวเตอร์โอลิมปิกระดับชาติ
      </>
    ),
  },
  {
    question: 'หากสมัครเสร็จแล้ว จะต้องทำอย่างไรต่อบ้าง',
    answer: (
      <>
        ระหว่างนี้จะไม่มีขั้นตอนอะไรที่จำเป็นต้องทำ
        แต่ทางเราขอแนะนำให้ลองทดสอบระบบให้ชินกับโจทย์ วิธีการใช้งานระบบ
        และการส่งคำตอบก่อน นอกจากนี้เราแนะนำให้ฝึกฝนการทำโจทย์จากเว็บไซต์ต่าง ๆ
        เช่นที่แจ้งไปก่อนหน้านี้
        หรือหากผู้เข้าแข่งขันอยากลองประลองฝีมือในการแข่งขันจริง ๆ
        เราแนะนำการแข่งขันเขียนโปรแกรมออนไลน์อื่น ๆ เช่น Codeforces เป็นต้น
      </>
    ),
  },
  {
    question: 'จะทราบได้อย่างไรว่าสมัครสำเร็จแล้ว',
    answer: (
      <>
        ผู้เข้าแข่งขันสามารถทดลองใช้ระบบได้ โดยหากสามารถลงชื่อเข้า (login)
        ได้ถือว่าการสมัครเสร็จสมบูรณ์ ทั้งนี้ หากข้อมูลการสมัคร(เช่นที่อยู่
        เบอร์โทรติดต่อ อีเมล) ผิดพลาด
        เราจะทำการติดต่อไปยังข้อมูลติดต่อเท่าที่หาได้อีกครั้ง
      </>
    ),
  },
]

export const Question = () => (
  <section className="flex flex-col items-center w-full h-auto bg-gray-900 px-8 sm:px-16 md:px-24 lg:px-32 py-20 sm:py-32">
    <div className="flex flex-col md:flex-row max-w-4xl">
      <div className="flex-none mr-12 mb-8">
        <p className="font-display text-3xl text-white">คำถามที่พบบ่อย</p>
        <div className="w-24 h-2 bg-red-400 mt-1" aria-hidden="true" />
      </div>
      <div className="flex flex-col">
        {question.map(({ question, answer }) => (
          <div key={question} className="mb-8">
            <p className="text-white font-display font-bold mb-4">{question}</p>
            <p className="text-white font-display">{answer}</p>
          </div>
        ))}
      </div>
    </div>
  </section>
)
