const About = () => {
  return (
    <main className="relative w-full min-h-screen bg-gray-900">
      <div className="absolute z-10 w-20 h-full transform translate-x-2 bg-red-400 right-full sm:translate-x-6 md:translate-x-12 lg:translate-x-16 xl:translate-x-20 lg:" />
      <div className="flex flex-col items-center">
        <div className="flex flex-col max-w-4xl px-10 sm:px-16 md:px-24 mt-28 sm:mt-40">
          <p className="text-3xl text-white font-display">เงื่อนไขการใช้งาน</p>
          <div className="prose prose-xl">
            <ol>
              <li>
                <p>ในเงื่อนไขการใช้งานฯ ฉบับนี้</p>
                <ul>
                  <li>
                    “เงื่อนไขการใช้งานฯ” หมายความว่า เงื่อนไขการใช้งานเว็บไซต์
                    tocpc.codes
                  </li>
                  <li>
                    “อุปกรณ์” หมายความว่า
                    คอมพิวเตอร์ที่สามารถนำมาใช้เข้าถึงเว็บไซต์ tocpc.codes ได้
                    โดยรวมไปด้วย แต่ไม่จำกัดถึง
                    <ul>
                      <li>คอมพิวเตอร์เดสก์ท็อป</li>
                      <li>สมาร์ทโฟน</li>
                      <li>แท็บเล็ต</li>
                    </ul>
                  </li>
                  <li>
                    &quot;ผู้เข้าแข่งขัน&quot; หมายความว่า
                    ผู้ที่สมัครเข้าแข่งขันผ่านเว็บไซต์ tocpc.codes
                  </li>
                  <li>
                    “ข้อมูล” หมายความว่า ข้อมูลในลักษณะใด ๆ
                    ก็ได้ทั้งที่เป็นข้อมูลที่บุคคลเข้าใจได้หรือไม่ก็ได้
                    โดยเป็นข้อมูลที่อุปกรณ์ต่าง ๆ
                    สามารถเข้าถึงได้โดยอัตโนมัติหรือถูกจัดไว้อย่างเป็นระบบพร้อมให้เข้าถึงข้อมูลเพื่อใช้ใน
                    <ul>
                      <li>
                        การเก็บรวบรวมเพื่อการประมวลผลของอุปกรณ์นั้น
                        หรือเพื่อเป็นส่วนหนึ่งของระบบข้อมูลเพื่อการประมวลผลนั้น
                      </li>
                      <li>
                        การประมวลผลโดยอุปกรณ์นั้นตามคำสั่งหรือโปรแกรมที่กำหนดไว้
                      </li>
                    </ul>
                  </li>
                  <li>
                    “ข้อมูลส่วนบุคคล” หมายความว่า
                    ข้อมูลส่วนบุคคลที่เชื่อมโยงกับบุคคลหรือสามารถระบุตัวตนได้
                    อาจรวมไปด้วย แต่ไม่จำกัดถึง ชื่อตัว ชื่อสกุล เลขโทรศัพท์
                    ที่อยู่อีเมล
                    หรือข้อมูลส่วนบุคคลไม่รวมถึงข้อมูลที่ไม่ได้ระบุตัวตนผู้ใช้โดยเฉพาะ
                  </li>
                  <li>
                    “บัญชี” หมายความว่า บัญชีที่ได้ลงทะเบียนไว้กับ tocpc.codes
                  </li>
                  <li>
                    “บริการ” หมายความรวมถึง บริการ เนื้อหา ฟีเจอร์ เทคโนโลยี
                    หรือคุณสมบัติ ตลอดจนเว็บไซต์ แอปพลิเคชัน
                    และบริการทั้งหมดที่เกี่ยวข้องกับ tocpc.codes
                  </li>
                  <li>
                    “ผู้ใช้” หมายความว่า บุคคลที่ใช้บริการหรือเข้าใช้เว็บไซต์
                  </li>
                  <li>
                    “คุกกี้” หมายความว่า
                    ไฟล์ข้อความขนาดเล็กที่เว็บไซต์ส่งไปยังอุปกรณ์ของผู้ใช้
                    เพื่อที่จะระบุตัวตนหรือเก็บข้อมูลในเบราว์เซอร์ของผู้ใช้
                  </li>
                  <li>
                    “เจ้าของข้อมูล” หมายความว่า
                    บุคคลที่ข้อมูลส่วนบุคคลนั้นระบุไปถึง
                    มิใช่กรณีที่บุคคลมีความเป็นเจ้าของข้อมูล
                    หรือเป็นผู้สร้างหรือเก็บรวบรวมข้อมูลนั้นเองเท่านั้น
                    บุคคลในที่นี้หมายถึง บุคคลธรรมดาเท่านั้น
                    แต่ไม่รวมถึงนิติบุคคลที่จัดตั้งขึ้นตามกฎหมาย
                  </li>
                  <li>
                    “บอต” หมายความว่า
                    โปรแกรมอัตโนมัติสำหรับทำหน้าที่อย่างใดอย่างหนึ่งบนอินเทอร์เน็ต
                  </li>
                </ul>
              </li>
              <li>
                <p>
                  เงื่อนไขการใช้งาน ฯ
                  ฉบับนี้มีผลกับทุกบุคคลที่เข้ามาใช้งานเว็บไซต์
                </p>
              </li>
              <li>
                <p>
                  ผู้ใช้ทุกบุคคลจะต้องใช้งานเว็บไซต์ตามที่ระบุไว้ในเงื่อนไขฯ
                  ฉบับนี้
                  โดยผู้ใช้จะไม่สามารถใช้งานใช้งานเว็บไซต์และสร้างบัญชีได้
                  หากไม่ได้ตกลงยอมรับเงื่อนไขการใช้งานฯ ฉบับนี้
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes อาจเปลี่ยนแปลงแก้ไขข้อเงื่อนไขการใช้งานฯ
                  ฉบับนี้ได้ตลอดเวลา ตามที่ tocpc.codes
                  เห็นสมควรซึ่งจะอยู่ภายใต้เงื่อนไขการใช้งานฯ ฉบับนี้
                  ในกรณีดังกล่าว tocpc.codes จะแจ้งเนื้อหาของเงื่อนไขการใช้งานฯ
                  รวมถึงวันที่มีผลบังคับใช้บนเว็บไซต์
                  หรืออาจแจ้งให้ทราบด้วยวิธีการอื่นใดตามที่ tocpc.codes กำหนด
                  ทั้งนี้ เงื่อนไขการใช้งานฯ
                  ฉบับแก้ไขจะมีผลบังคับใช้ตามวันที่กำหนดต่อไป
                </p>
              </li>
              <li>
                <p>
                  เมื่อใช้งาน ผู้ใช้งานมีความจำเป็นต้องสมัครบัญชี
                  โดยการลงทะเบียนด้วยข้อมูลบางประการ ทั้งนี้
                  ผู้ใช้ต้องให้ข้อมูลที่เป็นความจริง ถูกต้อง ครบถ้วน
                  โดยหากเกิดความเสียหายอันเกิดขึ้นจากการละเว้นในหน้าที่ของผู้ใช้เอง
                  tocpc.codes สงวนสิทธิ์ในการรับผิดชอบในความเสียหายทั้งสิ้น
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes สงวนสิทธิ์ในการลบบัญชีใด ๆ
                  ซึ่งเจ้าของบัญชีได้กระทำการที่ขัดต่อเงื่อนไขการใช้งานฯ ฉบับนี้
                  โดยไม่ต้องต้องบอกกล่าวล่วงหน้าใด ๆ
                  แก่ผู้ใช้บัญชีดังกล่าวได้ทราบก่อน
                </p>
              </li>
              <li>
                <p>
                  บัญชีแต่ละบัญชีในการใช้งานเว็บไซต์นั้น
                  มีไว้เพื่อการใช้งานเฉพาะบุคคล
                  และผู้ใช้เป็นเจ้าของบัญชีนั้นแต่เพียงผู้เดียว
                  ผู้ใช้ไม่สามารถโอน ให้ยืม จำหน่าย เปลี่ยนแปลง หรือกระทำการใด ๆ
                  ที่จะมีผลให้กรรมสิทธิ์ สิทธิ์ครอบครอง
                  และสิทธิ์ในการใช้บัญชีของตนถูกเคลื่อนย้ายไปแก่บุคคลอื่น
                  โดยที่บุคคลอื่นไม่สามารถรับช่วงสิทธิ์หรือสืบทอดบัญชีจากผู้ใช้ดังกล่าวได้เช่นกัน
                </p>
              </li>
              <li>
                <p>
                  บุคคลที่มีอายุต่ำกว่า 13 ปีบริบูรณ์
                  จะไม่สามารถใช้บริการเว็บไซต์หรือสร้างบัญชีได้
                </p>
              </li>
              <li>
                <p>
                  ผู้ใช้ต้องอ่านและทำความเข้าใจ
                  <a href="https://tocpc.codes/privacy-policy">
                    นโยบายความเป็นส่วนตัว
                  </a>
                  ก่อน จึงจะสามารถใช้งานเว็บไซต์และสร้างบัญชีได้
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes จะคุ้มครองความเป็นส่วนตัว
                  และข้อมูลส่วนบุคคลของผู้ใช้อย่างเหมาะสมตาม
                  <a href="https://tocpc.codes/privacy-policy">
                    นโยบายความเป็นส่วนตัว
                  </a>{' '}
                  tocpc.codes จะใช้ความระมัดระวัง
                  เพื่อให้แน่ใจว่ามีการจัดการข้อมูลใด ๆ
                  ซึ่งเก็บรวบรวมจากผู้ใช้อย่างเหมาะสมและปลอดภัย
                </p>
              </li>
              <li>
                <p>
                  ผู้ใช้เป็นผู้รับผิดชอบจัดหาอุปกรณ์ ระบบปฏิบัติการ
                  วิธีการเชื่อมต่อสื่อสารและกระแสไฟฟ้า อินเทอร์เน็ต ฯลฯ
                  ซึ่งจำเป็นต่อการใช้งาน ทั้งนี้
                  ผู้ใช้เป็นผู้ออกค่าใช้จ่ายทั้งสิ้น
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes สงวนสิทธิ์ในการจำกัดการใช้งานทั้งหมด
                  หรือบางส่วนของผู้ใช้
                  การสงวนสิทธิ์ดังกล่าวขึ้นอยู่กับเงื่อนไขที่ tocpc.codes
                  เห็นสมควร
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes
                  สงวนสิทธิ์ในการแก้ไขหรือเปลี่ยนแปลงเงื่อนไขการใช้งานฯ
                  ทั้งหมดหรือบางส่วนโดยไม่ต้องแจ้งผู้ใช้ล่วงหน้าตามที่
                  tocpc.codes เห็นสมควร
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes อาจสงวนหรือระงับการใช้งานทั้งหมดหรือบางส่วน
                  โดยไม่ต้องแจ้งให้ผู้ใข้ทราบล่วงหน้า เมื่อ tocpc.codes
                  เห็นว่ามีจำเป็น
                </p>
              </li>
              <li>
                <p>ผู้ใช้ไม่สามารถกระทำดังต่อไปนี้เมื่อใช้งานเว็บไซต์</p>
                <ul>
                  <li>
                    กระทำที่ฝ่าฝืนกฎหมาย ข้อบังคับ คำพิพากษา มติหรือคำสั่งศาล
                    มาตรการทางปกครองหรือข้อตกลงใด ๆ
                    ที่มีผลผูกพันทางกฎหมายทั้งสิ้น
                  </li>
                  <li>การกระทำที่ละเมิดสิทธิ์ในทรัพย์สินทางปัญญา</li>
                  <li>
                    การกระทำที่แสดงออกหรือส่งต่อซึ่งการแสดงออกที่มีลักษณะรุนแรงหรือเกี่ยวข้องกับเพศอย่างชัดเจน
                    การแสดงออกซึ่งภาพอนาจารหรือการทารุณกรรมทุกรูปแบบ
                    การแสดงออกซึ่งนำไปสู่การเลือกปฏิบัติทางด้านเชื้อชาติ สัญชาติ
                    ความเชื่อ เพศ สถานะทางสังคม ถิ่นกำเนิด ครอบครัว และอื่น ๆ
                    ที่เกี่ยวข้อง การแสดงออกที่ชักชวนหรือส่งเสริมการฆ่าตัวตาย
                    พฤติกรรมการทำร้ายตัวเอง การใช้ยาในทางที่ผิด หรือการแสดงออกใด
                    ๆ
                    ซึ่งเป็นการต่อต้านสังคมอันประกอบด้วยเนื้อหาที่ต่อต้านสังคมและทำให้บุคคลอื่นเกิดความไม่สบายใจ
                    เป็นต้น
                  </li>
                  <li>
                    การกระทำที่อาจทำให้ผู้อื่นเข้าใจผิดเกี่ยวกับ tocpc.codes
                    หรือบุคคลภายนอกหรือการจงใจเผยแพร่ข้อมูลเท็จ
                  </li>
                  <li>
                    การกระทำที่มีการใช้งาน เพื่อการขาย การตลาด การโฆษณา
                    การชักชวน หรือวัตถุประสงค์ทางการค้าอื่น ๆ
                    การกระทำที่มีการใช้งาน
                    เพื่อการกระทำทางเพศหรือการกระทำที่อนาจาร
                    การกระทำที่มิชอบด้วยกฎหมาย การกระทำที่ใช้งาน
                    เพื่อวัตถุประสงค์ในการคุกคาม
                    หรือการหมิ่นประมาทใส่ร้ายผู้ใช้อื่น ๆ หรือการกระทำใด ๆ
                    ซึ่งใช้งาน
                    เพื่อวัตถุประสงค์อื่นที่มิใช่จุดประสงค์ที่แท้จริงของการให้บริการ
                  </li>
                  <li>
                    การกระทำที่เป็นการเก็บรวบรวม เปิดเผย
                    หรือการให้ข้อมูลส่วนบุคคลของบุคคลอื่น ข้อมูลที่จดทะเบียน
                    ประวัติผู้ใช้ หรือข้อมูลอื่น ๆ
                    ในทำนองเดียวกันโดยไม่ชอบด้วยกฎหมายหรือไม่เหมาะสม
                  </li>
                  <li>
                    การกระทำซึ่งเป็นการแทรกแซงเครื่องแม่ข่าย
                    หรือระบบเครือข่ายของการให้บริการ
                    การกระทำซึ่งเป็นการใช้งานในทางที่ผิดด้วยการใช้บอต
                    เป็นเครื่องมือเพื่อโกงหรือด้วยวิธีการทางเทคนิคอื่น ๆ
                    การกระทำที่ใช้ข้อบกพร่องของการบริการ
                    และการกระทำที่เป็นการแทรกแซงการให้บริการของ tocpc.codes
                    หรือการใช้งานของผู้ใช้
                  </li>
                  <li>
                    การถอดรหัสซอร์สโค้ดของบริการโดยวิธีวิศวกรรมย้อนกลับ
                    การถอดประกอบหรือสิ่งที่คล้ายคลึงกัน
                  </li>
                  <li>
                    การกระทำที่ให้ความช่วยเหลือหรือส่งเสริมกิจกรรมใด ๆ
                    ที่ระบุไว้ใน (1) ถึง (8) ข้างต้น
                  </li>
                  <li>
                    การกระทำอื่นใดนอกจากที่ระบุในข้อ (1) ถึง (8) ที่ tocpc.codes
                    เห็นว่าไม่เหมาะสม
                  </li>
                </ul>
              </li>
              <li>
                <p>
                  ผู้ใช้ต้องใช้บริการฯ นี้ด้วยความเสี่ยงของตน
                  และเป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อการกระทำทั้งหมดหรือการกระทำใด
                  ๆ ที่กระทำไปอันเนื่องมาจากการใช้งานนี้
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes อาจระงับการให้บริการ ทั้งหมดหรือบางส่วน
                  ลบบัญชีหรือยกเลิกข้อตกลงใด ๆ
                  เกี่ยวกับการให้บริการระหว่างผู้ใช้ และ
                  tocpc.codes(รวมถึงแต่ไม่จำกัดเพียง ข้อตกลงใด ๆ
                  ตามเงื่อนไขการใช้งานฯ ฉบับนี้) หรือใช้มาตรการอื่นใดที่
                  tocpc.codes
                  พิจารณาว่ามีความจำเป็นและเหมาะสมโดยไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้า
                  ในกรณีที่ผู้ใช้รายนั้นกระทำการหรือไม่สามารถกระทำการอย่างหนึ่งอย่างใดดังต่อไปนี้
                </p>
                <ul>
                  <li>
                    ผู้ใช้ละเมิดกฎหมายที่เกี่ยวข้อง กฎระเบียบ เงื่อนไขการใช้งานฯ
                    ฉบับนี้
                  </li>
                  <li>
                    ผู้ใช้ทำให้ tocpc.codes
                    เสื่อมเสียความน่าเชื่อถือโดยการเผยแพร่ข้อมูลเท็จ
                    ใช้วิธีการโกง หรือวิธีการใด ๆ ทั้งสิ้น
                  </li>
                  <li>
                    tocpc.codes สูญเสียความไว้วางใจต่อผู้ใช้ หรือเมื่อ
                    tocpc.codes เห็นว่าไม่ควรให้บริการ
                    แก่ผู้ใช้ต่อไปด้วยเหตุผลนอกจากที่ได้กล่าวใน (1) ถึง (2)
                    ข้างต้น
                  </li>
                </ul>
              </li>
              <li>
                <p>
                  tocpc.codes จะไม่รับประกันใด ๆ
                  ไม่ว่าโดยชัดแจ้งหรือโดยปริยายเกี่ยวกับการให้บริการ
                  แก่ผู้ใช้ว่าบริการ นั้นปราศจากข้อบกพร่องใด ๆ ทั้งนี้
                  tocpc.codes ไม่มีความรับผิดชอบในการที่จะต้องจัดหาบริการ
                  ที่ไม่มีข้อบกพร่องดังกล่าวแต่อย่างใด
                </p>
              </li>
              <li>
                <p>
                  tocpc.codes จะไม่รับผิดชอบใด ๆ
                  ต่อความเสียหายอันเกิดจากการกระทำของผู้ใช้ในการใช้งาน
                  เว้นเสียแต่ความเสียหายดังกล่าวมีส่วนเกิดจากการกระทำโดยเจตนาหรือโดยประมาทของ
                  tocpc.codes.
                </p>
              </li>
              <li>
                <p>
                  ในกรณีผู้ใช้ได้รับความเสียหายอันเนื่องมาจากการกระทำโดยประมาทของ
                  tocpc.codes มีหน้าที่ใช้ค่าสินไหมทดแทนอันเกิดจากการละเมิดนั้น
                  อย่างไรก็ตามต้องอยู่ภายในขอบเขต
                  ความเสียหายที่เกิดขึ้นตามปกติธรรมดา
                </p>
              </li>
              <li>
                <p>
                  ในกรณีที่ข้อกำหนดข้อหนึ่งข้อใดของเงื่อนไขการใช้งานฯ
                  ฉบับนี้ละเมิดกฎหมายหรือกฎระเบียบใด ๆ
                  ซึ่งมีผลใช้บังคับแก่ข้อตกลงระหว่างผู้ใช้และ tocpc.codes
                  เกี่ยวกับการให้บริการ
                  ข้อบังคับดังกล่าวไม่มีผลใช้บังคับแก่ผู้ใช้ อย่างไรก็ตาม
                  ข้อบังคับอื่นนอกจากข้อบังคับดังกล่าวยังมีผลใช้บังคับอยู่ตามเดิม
                </p>
              </li>
              <li>
                <p>
                  ผู้ใช้อยู่ภายใต้กฎหมายของราชอาณาจักรไทยทุกฉบับที่มีผลบังคับใช้
                  รวมไปถึงแต่ไม่จำกัดเพียง
                  พ.ร.บ.ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2550
                </p>
              </li>
              <li>
                <p>
                  สำหรับการแจ้งเตือนจาก tocpc.codes ต่อผู้ใช้เกี่ยวกับการบริการ
                  tocpc.codes อาจใช้วิธีการที่ tocpc.codes เห็นว่าเหมาะสม
                </p>
              </li>
              <li>
                <p>
                  สำหรับการแจ้งเตือนจากผู้ใช้ต่อ tocpc.codes เกี่ยวกับบริการ
                  ผู้ใช้มีหน้าที่ต้องติดตามข่าวสารและการอัปเดตรายละเอียดต่าง ๆ
                  จาก tocpc.codes อย่างสม่ำเสมอ
                </p>
              </li>
              <li>
                <p>
                  สำหรับการแจ้งเตือนจากผู้ใช้ต่อ tocpc.codes เกี่ยวกับบริการ
                  ผู้ใช้มีหน้าที่ต้องติดตามข่าวสารและการอัปเดตรายละเอียดต่าง ๆ
                  จาก tocpc.codes อย่างสม่ำเสมอ
                </p>
              </li>
              <li>
                <p>
                  ข้อตกลงในการแข่งขันต่อไปนี้
                  มีผลผูกพันธ์กับผู้ที่สมัครแข่งขันแล้วเท่านั้น
                  ไม่รวมถึงผู้เข้าชมเว็บไซต์
                </p>
                <ul>
                  <li>
                    ผู้เข้าแข่งขันจะต้องรับทราบและปฏิบัติตามกฎทุกข้อต่อไปนี้อย่างเคร่งครัด
                  </li>
                  <li>
                    ผู้เข้าแข่งขัน จะต้องไม่พูดคุยสื่อสารกับผู้เข้าแข่งขันคนอื่น
                    ระหว่างการแข่งขัน
                  </li>
                  <li>
                    ผู้เข้าแข่งขัน สามารถใช้อุปกรณ์อิเล็กทรอนิกส์อย่างอื่นได้
                    เช่น เครื่องคิดเลข โทรศัพท์มือถือ และอื่น ๆ
                  </li>
                  <li>
                    ผู้เข้าแข่งขัน สามารถค้นหาข้อมูลในอินเทอร์เน็ตได้
                    ระหว่างการแข่งขัน แต่ไม่สามารถนำโจทย์การแข่งขันไปเผยแพร่
                    หรือถามบุคคลภายนอก ระหว่างการแข่งขัน
                  </li>
                  <li>
                    ผู้เข้าแข่งขัน สามารถใช้อุปกรณ์ทั่วไปอย่างอื่นได้ เช่น
                    กระดาษ ดินสอ ปากกา และอื่น ๆ
                  </li>
                  <li>
                    ผู้เข้าแข่งขัน ห้ามกระทำการใด ๆ
                    ที่เกี่ยวข้องกับการทุจริตระหว่างการแข่งขัน
                  </li>
                  <li>
                    ผู้เข้าแข่งขัน จะต้องไม่สร้างความเดือดร้อนให้กับ
                    ผู้เข้าแข่งขันผู้อื่น ทีมงานจัดการแข่งขัน
                    รวมไปถึงตัวระบบที่ใช้ในการแข่งขัน
                  </li>
                  <li>
                    ในระบบตารางคะแนนจะมี ชื่อ-นามสกุล และคะแนนของผู้เข้าแข่งขัน
                    ปรากฎอย่างเปิดเผย
                  </li>
                  <li>
                    หากทางทีมงานพบเห็นการกระทำผิดกฎใด ๆ
                    หรือพบว่ามีการพยายามหรือสร้างความเดือดร้อน
                    ทางทีมงานมีสิทธิ์ในการยุติการเข้าร่วมการแข่งขันของผู้เข้าแข่งขันได้
                  </li>
                  <li>ทางทีมงานขอสงวนสิทธิ์ในการยุติการแข่งขันในเวลาใดก็ได้</li>
                </ul>
              </li>
            </ol>
          </div>
        </div>
      </div>
    </main>
  )
}

export default About
